In [79]:
import sqlite3
import subprocess

In [80]:
conn = sqlite3.connect(":memory:")
c = conn.cursor()

In [81]:
cmd = "CREATE TABLE my_table (Name TEXT NOT NULL,\
                               Age INTEGER NOT NULL)"

c.execute(cmd)

In [82]:
conn.commit()

In [83]:
cmd = "ALTER TABLE my_table ADD COLUMN Salary INTEGER NOT NULL DEFAULT 0"
c.execute(cmd)
conn.commit()

In [84]:
cmd = "INSERT INTO my_table VALUES ('Joe', 32, 5000)"
c.execute(cmd)
conn.commit()

In [85]:
cmd = "INSERT INTO my_table VALUES ('{}', {}, {})".format('Kat', 50, 7000)
print(cmd)
c.execute(cmd)
conn.commit()

INSERT INTO my_table VALUES ('Kat', 50, 7000)

In [86]:
names = [ \
         ('James', 26, 2000),
         ('Lot', 66, 9000),
         ('Ian', 36, 4000),
]

c.executemany("INSERT INTO my_table VALUES (?,?,?)",names)
conn.commit()

In [87]:
c.execute("SELECT * from my_table where Name='Joe'")
result = c.fetchall()
print(result)

[('Joe', 32, 5000)]

In [88]:
c.execute("SELECT * from my_table where Age > 30")
result = c.fetchall()
print(result)
print(result[2])

[('Joe', 32, 5000), ('Kat', 50, 7000), ('Lot', 66, 9000), ('Ian', 36, 4000)]
('Lot', 66, 9000)

In [89]:
conn.close()